SELECT 
"фирма", "Хозяин"
,b1."ИнтернетЗаказ"
, "Оплачен"
, "№ счета", "Дата счета", "инфо"
,inetamount, inetdt, ps_id
FROM "Счета" b1,
(SELECT COUNT(*), b."ИнтернетЗаказ" 
--, b."Дата счета"
-- "фирма", "Хозяин", "№ счета", "Дата счета", 
       -- "ИнтернетЗаказ"
       -- inetamount, 
       -- inetdt, ps_id
FROM "Счета" b,
(SELECT DISTINCT "ИнтернетЗаказ"
  FROM "Счета"
  WHERE "Интернет"
  AND  "Дата счета" > '2016-09-01') io
WHERE b."ИнтернетЗаказ" = io."ИнтернетЗаказ"
GROUP BY b."ИнтернетЗаказ"
--, b."Дата счета"
HAVING COUNT(*)>1) dbl
WHERE dbl."ИнтернетЗаказ" = b1."ИнтернетЗаказ"
ORDER BY b1."ИнтернетЗаказ"